app/controllers/admin/advertising_categories_controller.rb

  def index
    if params[:search]
      @advertising_categories = AdvertisingCategory.search(params[:search]).order(:id).paginate(:page => params[:page], :per_page => 10)
---
SELECT  `advertising_categories`.* FROM `advertising_categories` ORDER BY `advertising_categories`.`id` ASC LIMIT 10 OFFSET 0

  def create
    @advertising_category = AdvertisingCategory.new(advertising_category_params)

    if @advertising_category.save
---
INSERT INTO `advertising_categories` (`name`, `created_at`, `updated_at`) VALUES ('Escola e Treinamentos', '2017-09-18 13:31:57', '2017-09-18 13:31:57')

  def update
    if @advertising_category.update(advertising_category_params)
---
UPDATE `advertising_categories` SET `color` = '#FF4500', `updated_at` = '2017-09-18 13:44:02' WHERE `advertising_categories`.`id` = 2

    def set_advertising_category
      @advertising_category = AdvertisingCategory.find(params[:id])
---
SELECT  `advertising_categories`.* FROM `advertising_categories` WHERE `advertising_categories`.`id` = 3 LIMIT 1