app/controllers/admin/advertisings_controller.rb

SELECT  `advertisings`.* FROM `advertisings` ORDER BY `advertisings`.`id` ASC LIMIT 10 OFFSET 0
---
  def index
    if params[:search]
      @advertisings = Advertising.search(params[:search]).order(:id).paginate(:page => params[:page], :per_page => 10)

UPDATE `advertisings` SET `cover_file_name` = 'yes_cursos.jpg', `cover_content_type` = 'image/jpeg', `cover_file_size` = 142066, `cover_updated_at` = '2017-09-18 13:31:06', `name` = 'Yes Treinamentos', `description` = 'TREINAMENTOS, CURSOS ENGENHARIA, ARQUITETURA, URBANISMO, DESIGN GRÁFICO, PUBLICIDADE, PROPAGANDA, INFORMÁTICA', `advertising_category_id` = 2, `updated_at` = '2017-09-18 13:31:06' WHERE `advertisings`.`id` = 1
---
  def update
    if @advertising.update(advertising_params)

SELECT  `advertisings`.* FROM `advertisings` WHERE `advertisings`.`id` = 3 LIMIT 1
---
    def set_advertising
      @advertising = Advertising.find(params[:id])