app/controllers/admin/banners_controller.rb

SELECT  `banners`.* FROM `banners` ORDER BY `banners`.`id` ASC LIMIT 10 OFFSET 0
---
  def index
    if params[:search]
      @banners = Banner.search(params[:search]).order(:id).paginate(:page => params[:page], :per_page => 10)

INSERT INTO `banners` (`name`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `order`, `url`, `status`, `target`) VALUES ('Banner 01', '2017-09-17 20:00:23', '2017-09-17 20:00:23', '01.png', 'image/png', 1012012, '2017-09-17 20:00:17', 1, '#', 'Ativo', '')
---
  def create
    @banner = Banner.new(banner_params)

    if @banner.save

UPDATE `banners` SET `image_file_name` = '03.png', `image_content_type` = 'image/png', `image_file_size` = 7074236, `image_updated_at` = '2017-09-18 10:47:21', `updated_at` = '2017-09-18 10:47:29' WHERE `banners`.`id` = 4
---
  def update
    if @banner.update(banner_params)

DELETE FROM `banners` WHERE `banners`.`id` = 1
---
  def destroy
    @banner.destroy

SELECT  `banners`.* FROM `banners` WHERE `banners`.`id` = 2 LIMIT 1
---
    def set_banner
      @banner = Banner.find(params[:id])