app/controllers/admin/companies_controller.rb

SELECT  `companies`.* FROM `companies` ORDER BY `companies`.`id` ASC LIMIT 10 OFFSET 0
---
  def index
    if params[:search]
      @companies = Company.search(params[:search]).order(:id).paginate(:page => params[:page], :per_page => 10)

INSERT INTO `companies` (`name`, `title`, `city_id`, `address`, `phone`, `email`, `latitude`, `longitude`, `zip_code`, `initial_care`, `end_care`, `initial_interval`, `end_range`, `md_facebook`, `md_google`, `md_twitter`, `obs`, `created_at`, `updated_at`) VALUES ('Yes Treinamentos', 'Yes Treinamentos', 1, 'Av. Tocantins', '', '', '', '', '', '2017-09-19 06:22:00', '2017-09-19 06:22:00', '2017-09-19 06:22:00', '2017-09-19 06:22:00', '', '', '', '', '2017-09-19 09:23:07', '2017-09-19 09:23:07')
---
  def create
    @company = Company.new(company_params)

    if @company.save

UPDATE `companies` SET `logo_file_name` = 'yes_cursos.jpg', `logo_content_type` = 'image/jpeg', `logo_file_size` = 56542, `logo_updated_at` = '2017-09-19 09:23:28', `updated_at` = '2017-09-19 09:23:28' WHERE `companies`.`id` = 2
---
  def update
    if @company.update(company_params)

SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 2 LIMIT 1
---
    def set_company
      @company = Company.find(params[:id])