app/controllers/admin/contacts_controller.rb

  def index
    if params[:search]
      @contacts = Contact.all
      @aguardando = Contact.search(params[:search]).where(:status => 'a').order(:id).paginate(:page => params[:page], :per_page => 5)
      @analise = Contact.search(params[:search]).where(:status => 'e').order(:id).paginate(:page => params[:page], :per_page => 5)
      @cancelado = Contact.search(params[:search]).where(:status => 'c').order(:id).paginate(:page => params[:page], :per_page => 5)
      @concluido = Contact.search(params[:search]).where(:status => 'u').order(:id).paginate(:page => params[:page], :per_page => 5)
      @todos = Contact.search(params[:search]).order(:id).paginate(:page => params[:page], :per_page => 5)
---
SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`status` = 'a' ORDER BY `contacts`.`id` ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `contacts` WHERE `contacts`.`status` = 'a'
SELECT  `contacts`.* FROM `contacts` ORDER BY `contacts`.`id` ASC LIMIT 5 OFFSET 0

  def create
    @contact = Contact.new(contact_params)

    if @contact.save
---
INSERT INTO `contacts` (`status`, `name`, `email`, `phone`, `subject`, `message`, `created_at`, `updated_at`) VALUES ('a', 'Tubal Leonel', 'tubal.ti@gmail.com', '9903-5935', 'sfasd', 'fasdfas', '2017-09-20 01:47:44', '2017-09-20 01:47:44')

  def destroy
    @contact.destroy
---
DELETE FROM `contacts` WHERE `contacts`.`id` = 6

    def set_contact
      @contact = Contact.find(params[:id])
---
SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 6 LIMIT 1