app/controllers/admin/curriculums_controller.rb

  def set_indication
    @references = Reference.all
---
SELECT `references`.* FROM `references`

  def index
    if params[:search]
      @curriculums = Curriculum.search(params[:search]).order(:id).paginate(:page => params[:page], :per_page => 5)
      @aguardando = Curriculum.search(params[:search]).where(:status => 'a').order(:id).paginate(:page => params[:page], :per_page => 5)
---
SELECT  `curriculums`.* FROM `curriculums` ORDER BY `curriculums`.`id` ASC LIMIT 5 OFFSET 0
SELECT  `curriculums`.* FROM `curriculums` WHERE `curriculums`.`status` = 'a' ORDER BY `curriculums`.`id` ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `curriculums` WHERE `curriculums`.`status` = 'a'

  def edit
    @reference = Reference.new
    @indication = Indication.new
    @course_interation = CourseInteration.new
    @references = Reference.where(:user_id => current_user.id).where(:page_id => params[:id])
    @indications = Indication.where(:user_id => current_user.id).where(:page_id => params[:id])
    @course_interations = CourseInteration.where(:user_id => current_user.id).where(:page_id => params[:id])
---
SELECT `references`.* FROM `references` WHERE `references`.`user_id` = 1 AND `references`.`page_id` = 5
SELECT `indications`.* FROM `indications` WHERE `indications`.`user_id` = 1 AND `indications`.`page_id` = 5
SELECT `course_interations`.* FROM `course_interations` WHERE `course_interations`.`user_id` = 1 AND `course_interations`.`page_id` = 5

  def create
    @curriculum = Curriculum.new(curriculum_params)

    if @curriculum.save
---
INSERT INTO `curriculums` (`name`, `birth`, `marital_status`, `identity`, `cpf`, `elector_title`, `inscription`, `zone`, `section`, `cnh`, `professional_experience`, `professional_preference`, `email`, `address`, `street`, `block`, `lot`, `sector`, `curriculum_office_id`, `zip_code`, `phone`, `cell_phone`, `message`, `study`, `teaching`, `period`, `employee`, `salary`, `father`, `profession_father`, `mother`, `profession_mother`, `created_at`, `updated_at`) VALUES ('', '2017-09-19', 's', '', '', '', '', '', '', 'n', '', '', '', '', '', '', '', '', 1, '', '', '', '', 's', 'f-i', 'i', 's', '', '', '', '', '', '2017-09-19 21:22:05', '2017-09-19 21:22:05')

    def set_curriculum
      @curriculum = Curriculum.find(params[:id])
---
SELECT  `curriculums`.* FROM `curriculums` WHERE `curriculums`.`id` = 5 LIMIT 1