app/controllers/admin/home_controller.rb

SELECT `curriculums`.* FROM `curriculums`
SELECT COUNT(*) FROM `companies`
SELECT `companies`.* FROM `companies`
SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`status` = 'a' ORDER BY `contacts`.`id` ASC LIMIT 6
SELECT  `users`.* FROM `users` LIMIT 8
---
  def index
    @curriculums = Curriculum.all
    @advertisings = Advertising.all
    @jobs = Job.all
    @users = User.all
    @companies = Company.all
    @contacts = Contact.all
    @contacts_limited = Contact.limit(6).order(:id).where(:status => 'a')
    @curriculums_limited = Curriculum.limit(6).order(:id).where(:status => 'a')
    @companies_limited = Company.limit(8)
    @users_limited = User.limit(8)