app/controllers/admin/pages_controller.rb

  def index
    if params[:search]
      @pages = Page.search(params[:search]).order(id: :desc).paginate(:page => params[:page], :per_page => 10)
---
SELECT  `pages`.* FROM `pages` ORDER BY `pages`.`id` DESC LIMIT 10 OFFSET 0

  def create
    @page = Page.new(page_params)

    if @page.save
---
INSERT INTO `pages` (`status`, `name`, `title`, `summary`, `description`, `created_at`, `updated_at`) VALUES ('a', 'Consultoria', 'Consultoria', '', '', '2017-09-19 16:49:22', '2017-09-19 16:49:22')

  def update
    if @page.update(page_params)
---
UPDATE `pages` SET `name` = 'Localização', `title` = 'Localização', `updated_at` = '2017-09-19 12:24:06' WHERE `pages`.`id` = 6

    def set_page
      @page = Page.find(params[:id])
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 3 LIMIT 1