app/controllers/admin/references_controller.rb

INSERT INTO `references` (`page`, `page_id`, `name`, `phone`, `user_id`, `created_at`, `updated_at`) VALUES ('curriculum', 5, 'referencia', '33333', 1, '2017-09-19 21:22:22', '2017-09-19 21:22:22')
---
  def create
    @reference = Reference.new(reference_params)

    if @reference.save