app/controllers/anuncio_controller.rb

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 3
SELECT `advertisings`.* FROM `advertisings`
---
	def index
		@pages = Page.where(:id => 3)
		@advertisings = Advertising.all

SELECT `advertisings`.* FROM `advertisings`
---
	def show
		@advertisings = Advertising.all

SELECT `advertisings`.* FROM `advertisings` WHERE `advertisings`.`id` IS NULL
---
	def set_advertising
	  @advertising = Advertising.find(params[:id])