app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    if @contact.save
---
INSERT INTO `contacts` (`name`, `email`, `phone`, `subject`, `message`, `created_at`, `updated_at`) VALUES ('Tubal Leonel', 'tubal.ti@gmail.com', '9903-5935', 'a', 'SDFASDFAS', '2017-09-20 01:52:17', '2017-09-20 01:52:17')

    def set_contact
      @contact = Contact.find(params[:id])
---
SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = NULL LIMIT 1