app/controllers/home_controller.rb

  def index

  	@banners = Banner.where(:status => "Ativo").order(:order)
---
SELECT `banners`.* FROM `banners` WHERE `banners`.`status` = 'Ativo' ORDER BY `banners`.`order` ASC