app/controllers/page_controller.rb

  def quem_somos
    @pages = Page.where(:id => 1)
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1

  def vagas
    @pages = Page.where(:id => 2)
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 2

  def planos
    @pages = Page.where(:id => 4)
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 4

  def empresas
    @pages = Page.where(:id => 5)
    @companies = Company.all
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 5
SELECT `companies`.* FROM `companies`

  def localizacao
    @pages = Page.where(:id => 6)
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 6

  def consultoria
    @pages = Page.where(:id => 7)
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 7

  def consultoria_empresa
    @pages = Page.where(:id => 8)
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 8

  def eja
    @pages = Page.where(:id => 9)
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 9